00100	 IDENTIFICATION DIVISION.
00200	 PROGRAM-ID.     CRTEST.
00300	
00400	     THIS PROGRAM TESTS THE FUNCTIONS OF THE
00500	     CRT DRIVERS USED WITH COBOL-80.
00600	
00700	 AUTHOR.         MICROSOFT.
00800	 DATE-WRITTEN.   01 JUNE 1980.
00900	 SECURITY.       NONE.
01000	
01100	 ENVIRONMENT DIVISION.
01200	
01300	 DATA DIVISION.
01900	
04300	 PROCEDURE DIVISION.
04400	 MAIN.
05500	     DISPLAY "Hola".
05600	
05700	     STOP RUN.
05800	
   