 IDENTIFICATION DIVISION.
 PROGRAM-ID.
     SEQ.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER.
     8080.
 OBJECT-COMPUTER.
     8080.
 DATA DIVISION.

 PROCEDURE DIVISION.
 BEGIN-PARA.
   DISPLAY 'Hola'.
   STOP RUN.
 



