	 IDENTIFICATION DIVISION.
	 PROGRAM-ID.     HELLO.
	 AUTHOR.         MICROSOFT.
	 DATE-WRITTEN.   01 JUNE 1980.
	 SECURITY.       NONE.
	
	 ENVIRONMENT DIVISION.
	
	 DATA DIVISION.
	
	 PROCEDURE DIVISION.
	 MAIN.
	     DISPLAY "Hola".
	     STOP RUN.
	
   