	IDENTIFICATION DIVISION.
	PROGRAM-ID.	QSORT.
	ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER.	DIGITAL GROUP
	OBJECT-COMPUTER.	DIGITAL GROUP
				MEMORY 57344 WORDS.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	    SELECT DATAIN  ASSIGN DISK.
	    SELECT DATAOUT ASSIGN DISK.
	DATA DIVISION.
	FILE SECTION.
	FD  DATAIN LABEL RECORD STANDARD
		   VALUE OF FILE-ID "QSORT.DAT".
	01  IN-FILE.
	    02  IF-CODE		PIC  X(2).
	    02  IF-NAME		PIC  X(20).
	FD  DATAOUT LABEL RECORD STANDARD
		    VALUE OF FILE-ID "RESULT.DAT".
	01  OUT-FILE		PIC  X(25).
	WORKING-STORAGE SECTION.
	77  EOF-DATAIN		PIC  A(1)  VALUE "N".
	77  TRUE		PIC  A(1)  VALUE "Y".
	77  FALSE		PIC  A(1)  VALUE "N".
	77  NO-DATA-TEXT	PIC  X(25)
				VALUE "no input data".
	77  TEMP		PIC  X(25).
	77  MAXDATA		PIC  9(2)  COMP VALUE 0.
	77  SWAP		PIC  9(2)  COMP VALUE 2.
	77  DATA-COUNT		PIC  9(2)  COMP VALUE 0.
	01  DATA-TABLE.
	    02  D-T		OCCURS 6
				INDEXED DT-PTR.
		03  DT-CODE	PIC  X(2).
		03  FILLER	PIC  X(3).
		03  DT-NAME	PIC  X(20).
	PROCEDURE DIVISION.
	MAIN-000.
	    OPEN INPUT  DATAIN.
	    OPEN OUTPUT DATAOUT.
	    MOVE SPACE TO DATA-TABLE.
	    PERFORM READ-DATA-900.
	    IF EOF-DATAIN EQUAL FALSE
		PERFORM GET-DATA-100 UNTIL
		    EOF-DATAIN EQUAL TRUE
		PERFORM SORT-DATA-110
		PERFORM WRITE-DATA-120
	    ELSE
		WRITE OUT-FILE FROM NO-DATA-TEXT.
	    CLOSE DATAOUT.
	    CLOSE DATAIN.
	    STOP RUN.
	GET-DATA-100.
	    ADD 1 TO DATA-COUNT.
	    SET DT-PTR TO 1.
	    SEARCH D-T VARYING DT-PTR
		END PERFORM MOVE-DATA-220
	        WHEN DT-CODE (DT-PTR) EQUAL IF-CODE
		    DISPLAY "Duplicate input data = " IN-FILE.
	    PERFORM READ-DATA-900.
	SORT-DATA-110.
	    MOVE DATA-COUNT TO MAXDATA.
	    SUBTRACT 1 FROM MAXDATA.
	    PERFORM SORT-CONTROL-200 UNTIL SWAP EQUAL 1.
	WRITE-DATA-120.
	    PERFORM PUT-DATA-210
		VARYING DT-PTR FROM 1 BY 1
		    UNTIL DT-PTR GREATER DATA-COUNT.
	SORT-CONTROL-200.
	    MOVE 1 TO SWAP.
	    PERFORM SORT-RELATION-300
		VARYING DT-PTR FROM 1 BY 1
		    UNTIL DT-PTR EQUAL MAXDATA.
	    MOVE SWAP TO MAXDATA.
	PUT-DATA-210.
	    WRITE OUT-FILE FROM D-T (DT-PTR).
	MOVE-DATA-220.
	    MOVE IF-CODE TO DT-CODE (DATA-COUNT).
	    MOVE IF-NAME TO DT-NAME (DATA-COUNT).
	SORT-RELATION-300.
	    IF D-T (DT-PTR) GREATER D-T (DT-PTR + 1)
		MOVE D-T (DT-PTR) TO TEMP
		MOVE D-T (DT-PTR + 1) TO D-T (DT-PTR)
		MOVE TEMP TO D-T (DT-PTR + 1)
		SET SWAP TO DT-PTR.
	READ-DATA-900.
	    READ DATAIN END
	        MOVE TRUE TO EOF-DATAIN.
