000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO.
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SOURCE-COMPUTER. RM-COBOL.
000800 OBJECT-COMPUTER. RM-COBOL.
001000 DATA DIVISION.
001100 FILE SECTION.
000260 WORKING-STORAGE SECTION.
000310 PROCEDURE DIVISION.
000320 START-PROCESSING.
000340     DISPLAY "Hola".
000460     STOP RUN.
   