0001 IDENTIFICATION DIVISION.
0002 PROGRAM-ID.
0003     HELLO.
0015 ENVIRONMENT DIVISION.
0016 CONFIGURATION SECTION.
0027 DATA DIVISION.
0057 WORKING-STORAGE SECTION.
0072 PROCEDURE DIVISION.
0073 BEGIN.
5500	 DISPLAY "Hola".
5600	
5700	 STOP RUN.
5800	
   